{
	"$schema" : "https://aka.ms/winget-packages.schema.2.0.json",
	"CreationDate" : "2026-04-11T03:55:27.283-00:00",
	"Sources" : 
	[
		{
			"Packages" : 
			[
				{
					"PackageIdentifier" : "BlueStack.BlueStacks"
				},
				{
					"PackageIdentifier" : "CPUID.HWMonitor"
				},
				{
					"PackageIdentifier" : "REALiX.HWiNFO"
				},
				{
					"PackageIdentifier" : "RARLab.WinRAR"
				},
				{
					"PackageIdentifier" : "mitmproxy.mitmproxy"
				},
				{
					"PackageIdentifier" : "Alacritty.Alacritty"
				},
				{
					"PackageIdentifier" : "OpenJS.NodeJS.LTS"
				},
				{
					"PackageIdentifier" : "Netbird.Netbird"
				},
				{
					"PackageIdentifier" : "Zoom.Zoom"
				},
				{
					"PackageIdentifier" : "gerardog.gsudo"
				},
				{
					"PackageIdentifier" : "Cloudflare.Warp"
				},
				{
					"PackageIdentifier" : "Inkscape.Inkscape"
				},
				{
					"PackageIdentifier" : "Microsoft.PowerShell"
				},
				{
					"PackageIdentifier" : "Microsoft.Edge"
				},
				{
					"PackageIdentifier" : "OBSProject.OBSStudio"
				},
				{
					"PackageIdentifier" : "Microsoft.VCRedist.2015+.x64"
				},
				{
					"PackageIdentifier" : "Kensington.KensingtonWorks"
				},
				{
					"PackageIdentifier" : "Anthropic.Claude"
				},
				{
					"PackageIdentifier" : "DBeaver.DBeaver.Community"
				},
				{
					"PackageIdentifier" : "Discord.Discord"
				},
				{
					"PackageIdentifier" : "Fastfetch-cli.Fastfetch"
				},
				{
					"PackageIdentifier" : "GIMP.GIMP.3"
				},
				{
					"PackageIdentifier" : "Google.Chrome.EXE"
				},
				{
					"PackageIdentifier" : "Google.Chrome.Beta.EXE"
				},
				{
					"PackageIdentifier" : "Microsoft.OneDrive"
				},
				{
					"PackageIdentifier" : "Microsoft.Teams.Classic"
				},
				{
					"PackageIdentifier" : "Telegram.TelegramDesktop"
				},
				{
					"PackageIdentifier" : "Microsoft.PowerToys"
				},
				{
					"PackageIdentifier" : "Canonical.Ubuntu"
				},
				{
					"PackageIdentifier" : "Microsoft.AppInstaller"
				},
				{
					"PackageIdentifier" : "Microsoft.UI.Xaml.2.7"
				},
				{
					"PackageIdentifier" : "Microsoft.UI.Xaml.2.8"
				},
				{
					"PackageIdentifier" : "Microsoft.VCLibs.Desktop.14"
				},
				{
					"PackageIdentifier" : "Microsoft.VCLibs.14"
				},
				{
					"PackageIdentifier" : "Microsoft.WindowsAppRuntime.1.5"
				},
				{
					"PackageIdentifier" : "Microsoft.WindowsAppRuntime.1.6"
				},
				{
					"PackageIdentifier" : "Microsoft.WindowsAppRuntime.1.7"
				},
				{
					"PackageIdentifier" : "Microsoft.WindowsAppRuntime.1.8"
				},
				{
					"PackageIdentifier" : "Microsoft.WindowsTerminal"
				},
				{
					"PackageIdentifier" : "Microsoft.WSL"
				},
				{
					"PackageIdentifier" : "TheBrowserCompany.Arc"
				},
				{
					"PackageIdentifier" : "Debian.Debian"
				}
			],
			"SourceDetails" : 
			{
				"Argument" : "https://cdn.winget.microsoft.com/cache",
				"Identifier" : "Microsoft.Winget.Source_8wekyb3d8bbwe",
				"Name" : "winget",
				"Type" : "Microsoft.PreIndexed.Package"
			}
		},
		{
			"Packages" : 
			[
				{
					"PackageIdentifier" : "9NKSQGP7F2NH"
				}
			],
			"SourceDetails" : 
			{
				"Argument" : "https://storeedgefd.dsx.mp.microsoft.com/v9.0",
				"Identifier" : "StoreEdgeFD",
				"Name" : "msstore",
				"Type" : "Microsoft.Rest"
			}
		}
	],
	"WinGetVersion" : "1.12.470"
}